sex_dict = {
    0: 'не указано',
    1: 'женский',
    2: 'мужской'
}

relations_dict = {
    0:
    {
        1: 'не женат / не замужем',
        2: 'есть друг / есть подруга',
        3: 'помолвлен / помолвлена',
        4: 'женат / замужем',
        5: 'всё сложно',
        6: 'в активном поиске',
        7: 'влюблён / влюблена',
        8: 'в гражданском браке',
        0: 'не указано'
    },
    1:
    {
        1: 'не замужем',
        2: 'есть друг',
        3: 'помолвлена',
        4: 'замужем',
        5: 'всё сложно',
        6: 'в активном поиске',
        7: 'влюблена',
        8: 'в гражданском браке',
        0: 'не указано'
    },
    2:
    {
        1: 'не женат',
        2: 'есть подруга',
        3: 'помолвлен',
        4: 'женат',
        5: 'всё сложно',
        6: 'в активном поиске',
        7: 'влюблён',
        8: 'в гражданском браке',
        0: 'не указано'
    }
}
