sex_dict = {
    0: 'не указано',
    1: 'женский',
    2: 'мужской'
}

relations_dict = {
    0:
    {
        1: 'не женат / не замужем',
        2: 'есть друг / есть подруга',
        3: 'помолвлен / помолвлена',
        4: 'женат / замужем',
        5: 'всё сложно',
        6: 'в активном поиске',
        7: 'влюблён / влюблена',
        8: 'в гражданском браке',
        0: 'не указано'
    },
    1:
    {
        1: 'не замужем',
        2: 'есть друг',
        3: 'помолвлена',
        4: 'замужем',
        5: 'всё сложно',
        6: 'в активном поиске',
        7: 'влюблена',
        8: 'в гражданском браке',
        0: 'не указано'
    },
    2:
    {
        1: 'не женат',
        2: 'есть подруга',
        3: 'помолвлен',
        4: 'женат',
        5: 'всё сложно',
        6: 'в активном поиске',
        7: 'влюблён',
        8: 'в гражданском браке',
        0: 'не указано'
    }
}

parameters_dict = {
    1: 'год рождения',
    2: 'пол',
    3: 'город',
    4: 'статус отношений',
}

options_messages = {
    'check_search': 'Введите номер команды:\n1 - Добавить в избранные\n2 - Добавить в чёрный список\n3 - Пропустить\n4 - Завершить поиск\n',
    'enter_age': 'Введите свой возраст (Число от 18 до 99)\n',
    'enter_sex': 'Укажите свой пол\n1 - Женский\n2 - Мужской\n',
    'enter_city': 'Измените город в настройках профиля\n',
    'enter_relation': 'Укажите статус отношений\n1 - не женат / не замужем\n2 - есть друг / есть подруга\n3 - помолвлен / помолвлена\n4 - женат / замужем\n5 - всё сложно\n6 - в активном поиске\n7 - влюблён / влюблена\n8 - в гражданском браке\n0 - не указано\n',
    'start': '1 - Начать новый поиск пары\n2 - Показать избранное\n3 - Закончить работу\n',
    'users_end_search': 'Поиск завершен\n',
    'end_search_list': 'Поиск завершен\nВсе результаты просмотрены\n',
    'adding_attributes': '1 - Внести недостающую информацию в чате\n2 - Завершить поиск\n',
    'end_work': 'Работа с системой закончена\nДля старта работы введите - Начать\n',
}